[PAD]
[UNK]
[SEP]
[CLS]
[MASK]
3750
648
900
3370
6122
4464
7399
4939
3659
4811
5598
669
2465
2400
5560
299
2109
4893
4411
1699
1519
803
1635
6065
5998
1903
5445
1324
2376
340
4659
3800
5948
1460
1633
1985
6017
2614
1465
3961
4853
5393
2210
6250
5602
3700
5977
2799
4646
7539
4516
2252
7543
151
6357
619
3915
5410
7495
913
6093
5620
4128
5780
5915
7194
4149
3223
2073
307
1375
2490
2662
5491
4490
5296
5036
4269
2106
5858
5330
3686
1394
1667
6045
465
3099
5176
5430
2539
1866
25
4559
6038
4704
192
1141
1080
6248
3272
5028
1567
6831
4190
6104
3618
3374
2859
7010
1702
3166
2119
3530
3605
4525
6407
4822
1099
6644
5659
7186
3772
5510
5589
531
6637
1407
5619
2986
4480
3641
4063
1920
1722
1906
2515
23
5677
910
5689
5778
5736
4124
5011
4167
5310
1070
1767
2212
7377
5612
7509
2595
1018
1736
6835
3263
281
3809
5537
1363
1277
3220
3893
3743
4958
2555
2541
5566
6887
1871
742
2289
2107
2265
4969
3300
2597
6040
6242
5949
4151
4409
5057
512
1066
486
3870
1854
5096
4562
2313
7467
7261
7058
2828
7492
62
5470
3747
7346
4109
6508
5051
2693
2112
7044
5526
7239
5702
3068
6832
3661
6810
4392
1731
7123
2364
2489
2380
1679
5264
3694
4211
6734
3859
6333
6293
1734
6929
6630
6980
6983
4936
6759
3560
3568
2729
6286
1215
1344
1815
4576
6656
7305
1401
1913
4721
5530
7444
7055
1031
2770
761
5520
5284
2304
4231
3792
2538
3634
150
2549
2461
6501
1647
6641
6101
4630
3630
5037
2975
2087
5271
2967
1877
7370
3193
2471
1036
4498
4230
2410
4139
3038
4655
1859
3706
2827
3196
2621
5640
1362
730
4148
3154
4301
2197
6301
3433
4293
1779
1348
3000
3586
450
7039
1279
6453
6289
3335
6609
606
3780
6206
2147
6770
3864
5718
544
1334
1726
4068
623
4967
5122
2466
2446
7255
2058
4333
4216
2923
1641
2717
6469
2674
6713
4261
6405
6714
4933
5282
1264
4350
955
6822
2810
5450
2456
1271
5328
3578
1816
2402
4499
3440
3523
3317
4462
6920
4412
7309
885
6811
2786
290
433
4671
5192
6909
5681
2115
5538
7328
7449
7160
922
1844
5724
3692
478
2791
19
408
134
3397
264
6485
3067
3912
6654
2444
670
541
5787
7403
94
7349
5041
4599
1241
6178
2891
7212
5338
893
656
3976
4046
4326
3971
868
4902
350
872
4180
3018
4321
6012
4181
133
1610
2192
1952
4089
4173
7159
4417
4298
2463
4233
2151
535
2154
5139
6227
4117
6521
2685
4744
6352
1511
3607
2899
4407
6666
1605
2435
671
2226
2695
1582
7400
5397
4531
3585
3242
5178
4105
1580
1258
1219
6740
4125
2974
4923
2282
5864
5505
790
7256
2042
7486
4866
6966
1695
2522
3695
6569
2477
5165
4080
7154
5547
6050
4612
5955
4981
6919
4998
6088
296
6861
3504
4469
5889
3329
5906
5519
1571
2029
4650
116
965
383
2612
5971
4510
4430
3461
1970
6833
2021
4145
3765
3648
3203
4568
3137
265
4741
826
64
5938
6518
6846
5006
4396
1934
4355
2993
2396
5292
3231
5498
3373
7363
2121
2315
7408
4166
330
3901
3508
314
343
5698
6722
1660
2848
6319
3106
4291
6143
4780
1457
847
6886
2448
1999
5744
1146
6689
248
5497
532
2205
5708
5099
2004
736
2506
1227
137
3117
5235
1323
6014
5810
2990
3764
5999
5166
7037
980
6350
3770
5788
4909
3056
5920
1116
2970
3464
920
7528
751
3342
4986
7420
6535
5816
507
4653
3500
3012
3945
1283
7465
1592
4802
3007
5926
794
663
3824
1308
2688
1395
3937
6182
2255
2334
3310
3289
1919
1706
6596
414
7047
1335
6160
7257
5226
88
4553
584
419
810
565
4381
7013
1613
5988
4351
5521
5105
3495
1778
4751
5370
2984
4114
6043
517
7354
6798
974
4042
4819
1043
6854
1951
591
5413
827
600
4760
3019
5221
6902
7327
7006
2499
101
4399
1684
5909
6768
1924
2851
6220
3366
6678
4237
4450
1245
1405
2592
764
6223
6284
3731
3255
2738
127
7251
6985
7436
5803
3051
1724
6235
1351
641
1688
2968
4053
5251
2348
2007
5562
5814
4369
4315
138
1214
3477
2716
2331
3725
5492
2835
4583
4677
3084
4603
3644
7023
220
3017
3646
1735
2570
4768
1315
6930
1132
7366
2378
5063
5984
2918
1899
3396
3481
4302
2528
144
5081
3819
6165
2218
6962
7134
1152
5957
5791
7127
1629
983
5688
211
5179
6602
3186
53
1697
6751
3283
2983
4220
2838
293
6651
6163
304
1255
2769
5801
5839
5117
6973
3134
2316
6176
4040
5693
3227
6515
979
6977
462
7077
3377
6567
936
2407
1170
6725
4543
7091
3097
543
1379
3247
3364
1914
1879
734
7532
6027
7421
6308
6662
3128
1103
26
902
569
3956
4542
7042
5095
3987
56
6899
4036
6015
6695
6760
1730
4858
7373
4595
6560
2230
3501
5881
873
2367
3844
1889
6115
316
6552
6007
6003
7490
3529
2722
495
5389
7147
4202
2328
894
2131
812
6583
4786
2602
5854
2229
5860
5775
6314
3129
7019
3531
4287
6613
4454
404
4458
4779
3938
2505
1805
3654
4329
4340
4558
499
6908
5997
38
442
5511
3775
5603
578
69
4372
1991
3032
197
5623
5005
5288
6482
1247
5660
6663
7032
4648
431
1061
3130
1327
1292
1299
4021
7326
5466
1388
7344
4377
7292
7206
5168
2076
2318
3598
2283
212
3613
3615
1168
1623
1252
3665
5396
5882
245
2399
4163
2099
7330
6968
6167
7125
5617
3860
2211
3949
3198
368
4636
6972
5741
6639
1267
7219
6729
5243
5486
4223
886
2708
1757
6588
5239
3691
2935
6615
4403
1590
3270
4547
6362
1693
2699
6940
1939
3456
4921
3299
3873
5381
1622
6549
3090
2683
4130
1960
3120
5298
5385
4205
5436
6047
6543
6004
83
3107
4183
3469
36
948
443
3515
6631
2397
3226
7507
5335
5495
7458
4876
4354
3608
869
4679
3015
318
5604
3762
7445
7395
6551
2023
1205
2491
3771
1232
1154
5573
7371
1891
57
3994
1946
930
4003
5883
7078
2873
5395
1987
6986
2741
657
2776
2642
1846
659
1819
1274
4305
355
6875
219
3606
4842
1148
1250
3782
1616
5367
2434
4643
7029
141
7157
7180
5422
1793
957
2495
5305
677
6674
1936
3418
7025
2484
4203
1670
3070
5606
3484
4544
5594
2181
5089
7121
6193
6192
2663
4894
4120
5480
5936
5678
6890
6066
6758
6587
1953
6888
3066
1715
7250
652
7254
4413
6390
1129
729
7117
1006
6063
3148
3577
6649
2847
5822
7393
7533
7033
4641
4118
3021
6149
7059
5194
3088
1370
5658
2502
4587
2745
1397
361
3442
5935
4214
1814
5482
3155
580
6671
632
5731
29
349
3783
2060
3811
6393
3436
1121
3040
4378
2145
6959
4691
781
2919
2727
1972
463
932
78
2795
3062
7546
6046
1746
3466
6221
5647
583
763
4491
7329
5821
6905
6917
5109
3151
470
6417
7311
3213
5278
6625
2124
4270
1518
7419
2594
1361
5493
2012
5649
5484
2766
2512
5169
3172
6243
4486
6881
6444
5472
3159
2221
5229
1110
993
3744
3479
445
1750
1698
3703
3055
3104
2411
216
1743
1386
2655
1782
7137
7038
2080
1078
5705
382
177
2196
4628
5426
3400
3720
6704
5610
1500
5535
405
341
5203
5574
4199
1569
1302
5631
2936
3039
5555
5322
5402
2130
2028
6981
2035
4122
3354
2610
1744
3112
7110
6898
3168
5202
2646
7447
6079
2164
3943
6296
100
2576
5695
2730
3482
1865
4065
2524
2024
2393
45
7045
252
1963
6356
6542
43
1907
3506
3257
1941
5950
4683
686
6447
796
3215
5525
5134
2091
180
7075
6748
1618
4778
4941
4993
1081
4829
811
4482
6788
2421
7544
3813
415
3126
6325
5663
4626
768
628
3651
1294
3766
5600
6127
1915
4987
1206
1956
4832
5121
5648
3189
6862
2511
3312
2910
5986
5870
6236
903
6078
4693
6682
292
2429
7129
1390
7192
13
2768
518
317
6037
5964
1425
5333
3080
4784
5380
2415
5872
84
4289
3030
5277
4861
2267
832
1545
998
2279
1389
5739
6111
1100
6298
6894
5295
6389
5728
4590
5502
5085
4005
6992
1829
1732
7387
750
1566
5536
4974
5064
2423
7378
1995
5160
2354
5289
2749
5056
4225
1459
4218
7122
2437
1853
6965
5683
851
7451
1833
6864
157
366
5190
5474
1515
2931
3955
7360
4848
6493
2120
505
654
5850
5644
889
5847
1014
4851
2626
3103
7144
239
5770
3650
1516
5374
4017
848
3438
571
4123
4976
7152
4030
2198
2480
3318
2879
3705
5416
1270
6658
5513
3793
7541
5369
634
6994
7106
182
5799
2329
2842
6324
2274
5716
7548
18
6203
4505
1160
6571
2022
1508
3324
5234
2370
6139
1242
3836
1151
5613
3285
6414
225
3512
5504
938
2771
4686
5153
1777
7527
3681
58
4260
5469
2046
6346
6600
3073
2346
4592
566
4245
3724
2525
456
3182
7295
3268
1211
3878
384
1839
1542
1721
339
3049
4106
3966
5217
2483
208
6398
1775
3711
3343
2049
6265
2234
5076
4781
3563
6375
420
5208
5899
7394
879
1620
515
7477
856
1965
2866
2841
5968
4144
457
3170
760
2656
6683
4988
2030
3209
986
6164
1640
7028
2047
4699
2248
1166
2603
6906
4448
7051
1885
5184
4324
4375
667
5399
3053
5488
7317
6441
3248
4917
5777
6360
1835
3533
1158
4878
4874
1883
1057
660
482
7213
4906
6119
2214
2127
6175
4836
6445
5026
7383
1291
2976
676
1402
4002
5651
2275
4150
3503
3818
2519
3407
1087
4429
3319
5694
908
2473
2785
4022
5254
4597
3004
3749
1176
5621
7475
4108
2564
1304
5361
2070
5804
1758
4334
459
4927
2998
6283
7362
4743
2474
4188
1832
489
7148
3472
5144
2068
4971
6327
4257
3309
1588
5793
5459
5281
5411
4061
6133
2379
3627
3978
3238
2667
2273
394
4718
6511
2908
7513
6311
2647
440
2327
4758
2702
1480
4335
6889
1855
3362
3414
4662
788
554
2369
3784
4337
4018
5257
513
6011
1022
2487
7008
4700
3988
6956
2728
4278
426
5514
7088
3111
5242
6158
6272
3430
4928
3444
4274
4801
853
2556
1265
1174
7479
3689
5917
2563
672
6575
7000
4436
6267
7062
5033
227
2762
802
740
3620
5297
4475
3583
2620
2867
6141
4680
347
1060
6996
247
4386
5347
777
4097
4794
1360
2942
2638
791
3359
3576
2709
7069
4567
5624
3718
5542
5477
2862
6574
6490
6287
2732
1111
3717
5004
4176
4934
1452
6396
5811
5316
1977
7111
5468
5348
2648
6161
5052
6817
7238
4152
778
6252
2439
7164
5785
5918
6640
14
4831
496
4249
3740
2233
7417
1325
5886
4841
2420
5922
4657
1603
1657
758
4478
4871
1289
4719
3360
6402
3489
2406
7175
3110
5834
2272
4750
1343
895
5247
2820
5931
945
1320
2979
572
7520
3842
1514
1827
519
5591
1818
3212
5501
5125
1076
1268
4536
6474
4968
3158
6454
1656
194
6825
2458
3349
498
1428
2586
5684
5034
550
60
5269
2639
485
6680
2453
2988
1737
5391
4070
7234
5638
1471
3742
4709
238
6234
5406
1638
2686
6802
5368
6318
1122
6337
5641
4119
1696
4153
3351
7462
6818
2428
2756
646
1858
3173
1220
2818
7224
4732
6738
2680
1764
5306
4366
536
1350
6895
244
1565
6976
3899
2582
6427
1964
6054
5017
226
6681
1564
2558
5308
4775
2772
1352
1008
2188
951
6780
581
2479
4431
3420
4402
5746
6754
2019
1981
2425
4083
2644
7375
6512
697
5581
2382
4052
1917
4276
3181
645
5136
4908
3921
136
4007
5753
6946
6819
1112
4280
6610
5047
3545
4835
203
2185
5823
1504
4285
5189
4728
2330
3059
4970
2682
746
4675
6431
2290
1973
6380
5709
3851
4191
4374
1474
3125
7510
3982
4157
3344
6144
6000
4930
1287
5438
3005
5383
4960
3745
1587
6087
6211
1107
6391
2169
3886
3036
978
816
7016
5928
3336
7109
2914
2179
4515
1783
2987
4479
631
1760
1096
2247
5773
3425
1986
4232
2567
5087
2431
4707
3095
5592
523
1184
3781
3727
455
2350
4736
6916
562
7210
1396
5656
3580
289
5824
1604
6947
5686
1090
5776
6423
2999
3267
1550
167
8
4560
699
1314
4077
2740
3161
1391
4466
5961
3821
4717
2055
6897
4439
5972
3290
4460
2591
5213
3845
4929
7207
176
6922
3657
5000
7196
7043
7241
6471
2363
561
1419
5815
2526
6928
7454
4690
4275
4951
843
1536
2673
3152
3517
5206
2514
490
327
3679
3338
4267
1842
3626
5884
7017
6355
6171
3093
2540
3150
452
3544
5691
4922
2017
3147
5572
5420
2508
4313
3002
5532
5371
1050
4082
3934
1243
926
3795
4762
2831
1073
1127
5862
4989
1497
785
7156
4782
7097
2005
6800
6635
7540
2863
1266
6781
5979
268
2011
2893
4627
5423
560
970
2566
7265
6892
1606
5929
7335
4357
5344
2438
6565
1950
2190
1678
7525
2724
5868
1195
6016
5960
5475
1424
3923
5969
2266
2366
1373
5127
6387
1690
2202
54
4729
6855
5769
1888
6295
4582
6134
3326
6842
4796
732
2572
3435
6507
7496
6720
1719
4265
7512
2530
752
4461
152
1435
7452
1295
6057
1142
1540
5233
4006
5954
6256
1002
981
5214
3266
3167
4767
4912
2804
5200
4695
4194
5618
6504
5182
5937
5907
2209
4745
715
5118
3643
3455
35
4169
430
3253
6430
4034
4614
881
6108
438
399
4310
6487
6500
159
4090
795
5720
5529
4493
7483
7222
3778
6036
1791
5360
743
3327
1755
3207
1718
2293
592
338
4761
4512
195
5215
1892
3079
2857
1013
6436
3914
642
1510
418
3992
3554
1902
6694
4442
1047
2995
1780
1092
3020
3232
218
2144
1453
5900
7426
6750
711
4748
6730
3614
3403
5552
6799
1431
7339
4814
5050
7391
6055
3200
3905
1631
1440
6608
3603
4255
6472
7245
2876
6562
1741
1940
178
4356
5940
7183
6838
817
3868
4757
6621
3729
5956
6829
3177
4985
326
5273
7353
7169
878
7380
7150
5869
5571
4873
1619
859
4506
4476
4380
2103
3951
17
6197
6971
1200
2761
6510
7493
300
5518
2351
4444
1124
950
2136
2734
5715
5212
1556
4066
2852
253
6796
1905
2691
5020
6764
3113
5467
757
3952
234
3528
3850
3494
240
1260
7098
739
1671
1023
7208
3983
1065
7225
1745
6582
7197
2260
228
214
4405
789
611
4500
7529
5274
3385
1042
6513
5792
2710
1916
6702
156
4991
413
1651
3910
119
1071
2341
89
6303
3662
4504
3647
6189
6815
1502
3649
1164
3716
2178
1086
2714
6032
1297
2924
4323
7404
6870
5690
7300
6347
4358
4940
2240
128
4887
4004
555
5156
6690
1423
1868
3280
3977
962
3262
2138
4742
3946
4862
2345
6517
2468
3925
4055
4408
5003
6830
2139
5636
5673
7226
7001
6804
332
5714
1221
2713
4611
354
4766
3141
1251
4382
1191
4556
3345
988
2581
6914
1273
7453
5340
3856
7015
254
2832
3371
6675
2140
1769
2394
6056
4575
1332
4914
5258
5632
266
2631
2236
1838
5442
2231
6254
5255
3918
7299
7272
5398
5595
4031
839
6467
3617
3054
5635
2056
4262
4514
4651
7131
4234
3610
2172
2739
5548
337
230
3313
3411
780
2156
1639
727
7410
6198
3052
3273
6364
6784
112
4777
1326
6757
3855
7034
891
6989
6570
2653
7501
1416
4896
3225
741
964
5315
1140
830
6404
367
733
377
1609
3897
4973
7170
3096
4509
320
6812
5668
145
5317
5894
22
6335
4731
4715
397
5177
5082
6199
61
6059
2945
1928
529
2422
4961
1105
411
1691
4623
2925
5974
5723
6893
3848
6135
610
4555
2562
6067
403
7464
3447
7116
6377
7096
4720
5092
6386
122
805
476
469
5325
3941
5895
1547
1163
1278
1364
2307
149
1826
1822
1449
4624
1645
428
956
2044
425
5379
2054
473
5861
5865
1627
1055
2359
3416
2561
3631
2958
5512
187
6151
4864
6244
6941
3146
5970
373
500
3451
3622
7505
724
3758
3121
3998
1306
4012
3011
2069
6338
3917
4903
315
1072
4615
3233
1538
2401
3807
5829
2064
4440
285
6277
1486
5752
5228
2964
7086
4949
2875
959
5614
336
7190
2000
3294
4716
7282
5205
1579
4353
4548
7442
4497
2571
3825
5697
854
1648
2356
5129
7424
533
3306
4660
5094
574
3969
1848
2874
823
1984
372
4565
3022
7168
6845
975
3320
1347
7333
5873
722
6949
6379
3732
3999
2598
2457
162
2972
7534
5429
3866
4771
3746
1068
939
6473
7350
301
946
3406
5
6633
2523
720
3721
6591
2472
4549
6094
907
2950
3304
6636
6062
7310
6878
2189
2629
5813
4410
1235
4652
76
6450
7031
1598
7289
4889
1102
6424
6126
6749
2237
5892
6307
1694
7491
449
6329
6718
4911
6257
3565
2098
3057
6769
5392
1831
1171
3459
5941
6142
360
6266
5418
1958
3929
3521
5876
933
2902
3728
621
3664
6932
2288
5433
4956
6753
6262
4658
5059
395
1341
6807
3676
3194
698
577
7185
1614
2547
3254
235
1733
6083
6937
5133
2391
1234
4843
3108
3869
6292
2778
2917
7012
297
3986
257
3265
2604
7515
3127
5607
6085
3567
5578
3536
4799
2358
5456
682
674
7368
4172
1676
6790
2798
4950
679
5540
3668
6611
1044
2228
2513
644
6660
2721
3483
1563
5634
4557
804
949
3271
5840
3829
2299
3894
3973
5903
5010
1870
6771
960
707
2809
5874
1411
2141
6809
1959
1509
6762
1529
2132
207
1248
564
3562
103
2447
3653
1787
3346
6848
1089
7440
3083
5071
1451
710
40
1931
4096
1849
4093
5417
579
5074
6497
7214
7361
5762
6435
5963
1544
4872
1406
4574
7381
3683
6840
2310
7411
3144
1938
4852
3595
2102
1727
5287
713
1728
6174
3328
2901
1000
2636
4258
5596
762
1208
5580
1417
6852
4451
2027
3990
7423
5137
181
6850
1710
3109
2170
852
1033
302
370
4924
6684
1901
5887
2705
7306
806
1716
6557
1669
7162
3340
6128
770
429
1489
2381
6233
3445
3
7422
3258
7188
5107
850
3670
2765
3871
7223
3907
2284
6847
5115
3131
6697
4578
1307
7469
3572
1792
4299
6020
4048
1199
6545
2938
2337
7531
5719
1339
5362
2253
1366
5123
5674
2929
6868
1309
2814
3518
217
175
447
3628
4517
324
6924
4273
4996
6522
7181
5471
468
5921
1811
2
7216
5901
6785
4295
7046
6491
4606
1441
688
1180
901
6506
5013
6113
2419
3975
958
2510
4763
3723
3311
2374
753
5856
6882
3779
1179
5210
2239
7318
728
7523
604
3812
2249
3965
7202
1650
5093
1674
2123
67
3714
1890
6988
6921
5293
4712
4722
6348
2679
3216
6
125
6214
2930
3277
2531
5405
622
1878
1045
5382
1182
2781
4300
6116
6563
586
1595
797
1966
2067
1173
5018
3558
3160
896
1384
2232
7446
1298
1157
115
72
5106
1466
3023
6900
323
1275
5733
3415
81
6328
2892
4168
5751
4776
6237
2285
2706
6156
3655
6181
7494
4999
2220
5932
4416
5114
174
835
4078
2956
875
1608
551
5008
5256
1682
5149
1532
927
2478
4390
2652
2939
2985
4870
417
5533
6866
5404
3047
1212
684
7277
6185
3900
3889
1874
2038
2640
2250
98
5951
7294
4640
283
3903
2812
2485
3391
4164
3334
6091
3427
1010
5001
1433
1082
6733
4992
1482
110
651
1643
1093
3139
2291
6191
3487
6661
2787
7093
1038
3960
4788
6279
6023
3754
2669
2504
2689
1812
5478
5337
483
4702
653
2565
4676
887
59
1661
3814
2166
4175
912
2905
5687
1751
5431
1525
386
4522
204
2937
3833
5601
6231
4155
6782
1685
6229
2278
2911
4916
6843
1172
2194
5452
250
2692
6313
5546
2947
3499
4824
7312
6460
1128
479
6238
5311
530
4817
378
4696
3698
1272
509
6455
1900
2944
5754
7405
5549
5797
7061
2953
3667
6594
6958
233
709
5978
7285
3426
5097
1358
2703
2224
118
1546
5952
4437
2045
1823
693
1948
1978
7519
3443
3526
7535
2268
5848
6618
2006
3940
3542
7301
1004
3046
5779
1753
5171
5241
7179
4014
4730
3462
4059
5476
5738
4584
6580
1921
3734
5261
3153
1067
3854
5088
5487
165
5650
952
164
3570
6857
3006
6140
4419
5461
6369
6316
106
1599
5796
2113
4821
1594
3756
1458
1496
2321
5517
4015
5622
5186
7094
4759
5556
700
2167
2965
1041
1481
5352
3325
1961
4854
2752
5527
2796
7084
5147
7332
2634
3449
7498
107
7459
3592
7345
7514
4790
4239
2665
4
1809
5494
6099
6147
1414
1700
4774
6334
4304
3808
4250
4494
2297
3557
3947
1478
5902
7050
7074
5758
4789
246
7542
943
3297
7342
3348
5152
2395
681
3063
1084
7499
2105
6896
3003
2339
4812
5174
421
1398
3275
1108
2616
5575
1196
3383
2032
2389
1522
7215
5637
2117
2008
4263
7275
5819
1923
731
2057
504
213
2182
5120
7288
3251
400
5947
3428
4572
5039
6153
1909
4642
553
5885
4619
74
2390
3044
7149
95
7060
6805
295
5019
4982
5608
5545
3805
3408
3571
7336
5207
2834
6406
3474
2496
2529
774
2254
3596
5544
844
1856
1296
5032
605
5993
5079
3485
963
502
1864
6294
1028
4880
2432
635
7478
4667
1367
7545
1840
3984
4954
2641
6370
1378
620
3157
6385
6679
2227
385
6939
5286
6275
6787
4837
5703
2615
4420
5628
1165
838
6481
3081
5506
4856
3797
4110
2455
7100
4279
6304
1383
3722
6084
4423
6533
5191
198
2033
2963
2527
2864
3368
7163
4793
3392
5270
286
3376
158
5443
5113
2946
82
1413
3822
5783
1555
4397
7412
7313
558
6408
4198
5197
2596
5040
7537
5366
841
6372
7448
2632
612
6219
1615
4739
6659
2163
5223
6400
7120
6107
2559
7243
2966
708
5657
2583
6264
4705
3308
2940
6462
2223
6998
1256
1485
6031
3776
3882
1662
3535
4133
6100
4975
4897
7461
3190
3249
3696
1880
5835
1186
4879
3785
4428
4342
70
4035
1056
3234
2811
1461
5183
831
2623
2780
6463
6259
2168
1861
2036
5054
5995
7118
1720
4875
1126
643
1353
3767
1993
2550
3967
510
2915
1749
4297
5851
4178
5563
2336
2535
6475
2507
6002
5939
1976
2039
2149
3733
5781
4749
1225
5263
755
3763
3957
1794
1442
1630
7067
2951
2897
5387
1725
2440
104
3087
779
3058
185
745
5696
4957
7303
6696
6026
6064
2637
4131
4963
4051
1664
6786
3496
4221
1908
4088
7365
5111
1083
4596
24
1467
6483
260
6345
424
4545
2079
2855
168
5128
4978
5625
7177
2996
4844
6874
453
4521
4094
171
2659
4638
783
5567
407
1573
79
2470
7103
1175
2800
2922
4907
345
3184
557
4081
4580
7171
3625
6828
590
5825
3217
3931
6539
782
6918
525
1543
7101
16
602
6960
5962
3534
4826
1517
1828
944
2065
3959
6821
7227
7500
7286
191
1873
863
2912
7036
2043
3179
6974
6667
1752
3769
545
7142
691
4885
4395
2894
540
7176
1761
7364
3419
6013
6546
4834
6365
2347
6712
5131
7414
5732
3315
3753
4995
99
4171
7409
7203
4266
4966
5890
1763
918
2973
2613
7191
169
5162
714
4534
3219
4944
5942
6150
539
1882
3115
416
1188
673
2599
5990
6358
5669
615
2081
4363
2568
3710
6616
232
3286
6439
3412
4327
3936
916
6544
4797
1432
4103
2606
3393
2978
4487
6162
261
3132
3708
1742
4895
1040
5193
6531
4215
6954
4809
2751
3243
940
6418
7066
4513
2775
1409
3804
4050
123
3208
6239
5259
7236
7530
52
2129
2575
1974
2672
6232
3379
1032
570
2503
1686
4137
5424
358
2089
6556
75
4529
6058
6429
7184
6392
5944
1007
3086
1005
143
6534
5652
2460
994
5246
277
2100
6727
695
1410
6686
3827
1475
5349
7304
6323
1576
2146
1666
6486
5415
3331
6622
6388
2162
2718
2789
6001
2320
7266
4689
2025
2707
3933
3061
1570
369
5855
5376
2830
7187
4492
2187
3025
4639
6039
7115
2332
5067
501
1189
5407
1336
2449
2241
1559
3048
6188
4008
690
2955
2155
5457
3911
6614
4663
1030
1713
2607
4467
5421
5898
3246
1426
5806
3045
5444
124
5048
2880
7473
6103
6326
196
582
1492
4610
2219
448
2992
5262
599
2546
3034
2257
4581
5561
5195
1236
4935
4079
3974
4850
799
3735
48
6632
6646
4314
3375
7470
5761
5981
4918
6527
1652
3693
5727
6249
1201
3806
7341
5341
1801
6155
6415
267
967
2096
4882
6129
864
3078
5388
7124
6883
6033
3541
5154
3611
6499
3492
1910
6584
288
1436
3178
2003
6595
4538
4177
3801
222
5818
6359
5151
6834
6090
6130
2404
7228
3922
6502
3218
6166
1400
4206
209
6019
5237
3457
6110
5713
1246
1575
7334
3323
5692
5772
4752
2152
4827
793
7248
4288
6112
1672
2063
4424
5086
5022
1281
4530
5353
1285
1935
7014
888
503
3538
3413
4681
2110
3071
4189
5409
4507
7356
7441
2413
2183
2160
2195
744
7235
2426
6190
492
1796
2664
898
5653
6096
3876
4000
3604
2492
3857
7369
5959
6904
637
1625
6461
837
1768
6420
3192
3847
4062
678
6744
2486
1162
139
6255
312
5201
6204
4919
3826
6664
7389
432
1887
6154
5807
1149
2980
4528
93
5857
2793
6528
4254
3522
6035
1328
6041
4060
5812
5933
3788
5679
5774
4433
1456
5667
3369
6218
5680
1847
202
344
1178
3468
6200
1954
7536
3537
117
3010
548
6564
2026
4383
5249
1046
6950
5605
3042
5808
3561
704
3669
2078
6225
5924
6488
5304
2352
2200
4649
2712
7406
4942
2927
4243
1527
3964
4449
6955
4926
4376
472
6477
1357
6858
1860
7517
2957
3581
5685
4165
2398
1843
1943
4477
6049
1305
4185
5102
5155
2701
1254
6247
4654
4694
3602
3228
3075
4607
4635
1377
3624
2774
3794
303
2657
6912
3347
7141
2758
4984
4364
6434
6576
4074
1382
3493
7258
996
5276
617
7274
3041
941
6022
4604
1387
2731
6820
1677
1533
6708
1925
2670
2225
2819
2806
821
32
6240
858
3136
5551
7200
4368
3388
6957
1365
6877
7252
7182
6726
1557
193
3707
5163
1313
5108
4962
2794
917
1632
924
4937
3507
528
4625
7049
3065
3547
7048
1404
2114
42
2587
1988
3924
4979
2943
7189
3954
976
6121
6195
4898
2878
6526
3549
1654
6931
4348
4343
461
5717
2933
2309
2243
4311
6102
5541
389
435
6371
7114
7151
987
588
5905
4618
911
1097
1499
7398
534
4983
4229
1190
4341
201
3566
4041
2031
3573
4539
1037
2649
1537
1658
6561
1810
5666
1109
6529
1230
4159
4016
4585
921
6746
20
845
1493
7229
3591
3736
1125
7508
3551
953
4422
2048
4997
6867
1088
3454
5272
5836
1637
6624
6401
6739
765
1572
1802
573
647
359
1642
721
7244
3016
5927
3791
1872
4025
706
6184
3239
4901
1216
5584
7064
5080
6428
4723
1894
2754
7135
5481
1634
6741
4550
5615
4953
5805
7230
7516
357
1059
961
7432
1601
4033
6331
3240
3838
5266
2521
6194
3188
4196
34
4533
10
5896
2126
1817
3757
393
4904
3556
4174
147
2083
2443
4158
1177
4783
1159
5609
607
5967
1130
3237
3423
1636
2409
4401
1857
1740
1346
1851
2601
2408
4242
1867
4142
862
4714
1837
5384
890
6263
5994
146
4756
1003
3550
1213
4312
305
6880
5225
4865
6520
2537
4884
5671
3124
6117
6366
5664
3680
2697
7138
1290
6458
3867
627
4038
7081
3660
1209
6105
5425
5646
4569
4365
1712
870
3140
749
6440
5016
3666
242
1789
1218
321
5062
3409
4186
5342
4098
4385
3206
3417
4026
5786
2534
3958
4001
6525
6217
2335
2840
5219
4134
5586
5735
613
4349
2261
5706
4347
3588
3332
4785
3453
3597
3116
718
6074
1535
2849
231
2733
7158
973
4857
1611
1762
7
5722
1506
668
587
3875
1541
1422
6736
4092
5725
4932
6601
2635
675
365
6604
6341
6177
1421
7140
3357
7139
1012
3013
7237
6590
7416
6397
6936
6538
4481
6124
4737
6208
2737
7502
4344
1646
4682
6261
2898
346
798
2377
189
3394
1490
6961
3260
1933
3633
5755
7056
2134
6871
3759
7022
1445
6677
2609
1257
3908
3511
6773
2952
1863
6806
2088
2755
866
65
1443
2627
6514
4740
2590
3579
3991
3935
5500
696
6503
4485
1342
3381
6028
6952
5303
4362
1053
3204
190
2675
2821
142
3527
4049
2111
1593
4990
50
4200
3072
3105
822
5503
269
6309
1596
3843
3321
135
3175
5483
5507
7005
5672
2822
294
5820
5198
2493
3450
2735
2797
4473
5485
685
188
6791
4011
6910
3682
7119
251
3008
4361
6628
1628
2014
173
4633
4069
6097
5795
5042
3677
6765
2690
3138
7089
5943
4501
6246
6607
4394
6665
3673
6685
2482
1711
6993
6071
4240
3390
6775
4678
3944
5965
2720
7080
2319
3895
7260
6278
4746
1161
2412
4938
6409
6984
4338
1898
1707
7347
4713
3037
4846
3690
4899
3363
5175
1578
6647
1770
390
2150
1192
3786
3645
5279
1450
5642
7068
5676
5354
5142
6849
6480
5053
7146
3828
3211
5058
2605
5434
655
322
3100
2174
2053
2805
4328
131
474
5170
2815
6120
999
2259
6030
1185
6496
4389
7472
5661
1039
2557
1074
1498
215
2890
3509
2015
5312
31
6839
6793
5138
3183
4674
5432
6987
1434
4306
6411
2333
4591
3553
5534
5350
2773
6844
3229
4438
5453
1487
206
1617
2469
968
3802
5250
5867
833
2368
1714
2322
4474
4084
3559
771
2302
1399
1034
1893
2869
815
7526
6999
909
1075
2464
3834
256
4072
3927
3480
33
2900
4726
4359
7220
521
2311
6505
4071
6865
3993
4360
2418
929
6209
7488
1549
3135
2608
3398
5049
4613
3287
1337
2816
436
1319
3919
5309
2928
6024
3741
1975
471
4920
1123
6813
6437
5729
563
5831
2856
3865
4009
5238
4204
4058
6395
6479
5372
3314
5280
4798
1881
2441
2868
1558
2886
4588
5024
120
6717
1330
2759
6226
6212
3519
2611
1912
6470
6761
1852
7315
1703
4445
4830
4608
813
2405
6300
3930
2618
6207
111
6363
5579
4085
3601
5465
2668
972
6705
4644
6082
2497
4489
6373
4384
6789
7205
484
6605
5734
3890
1754
1203
255
2262
2961
3205
2344
51
6653
1776
2542
3575
480
5323
7270
4773
5451
1781
4027
754
3486
5355
3840
97
7511
4136
6648
3441
6752
7291
1001
6756
329
3156
2750
2850
6443
773
4045
5265
4107
594
6827
5524
108
6970
5173
5794
4634
3060
2643
7437
2817
2175
568
2823
665
786
4888
6703
6944
6933
2746
5490
3684
840
3145
102
6755
1528
6081
7323
1505
7054
6269
3970
0
6963
3024
567
6676
2424
5187
1834
7337
6068
5496
205
434
4179
2326
3448
1118
5645
6048
1472
3091
3122
608
7024
4426
6540
2092
4247
2118
243
1491
3688
2871
3341
6568
7217
3525
966
7302
5832
7007
3082
846
5143
1937
5412
2051
4047
5879
2654
2676
3439
4825
5817
3372
1293
5987
4415
170
1147
5528
2907
3291
2954
7143
4828
5707
2481
5313
353
2962
7463
5577
7092
1979
2843
4905
7201
3926
3748
4765
4815
2895
1237
4632
1996
1597
77
376
4414
2305
3730
1368
776
934
2016
5845
1222
460
4102
2340
1131
4121
6824
6577
905
2361
5675
4253
5364
4600
2436
4387
2186
3799
6532
2861
2916
6213
2569
7133
925
4452
4943
3968
6138
5539
609
4855
2372
475
2536
7132
7307
6315
4101
2711
5038
6260
626
282
3751
4309
5314
559
2836
7476
3452
3637
1113
291
5643
601
5148
6336
6803
6339
39
5065
4668
3962
3142
6383
451
2982
114
3316
1240
2462
1922
3470
4869
914
6797
2158
4839
860
6524
3386
4336
3195
4210
2303
493
4248
1520
4727
694
3963
1962
7297
6766
6776
7130
6634
3803
855
6368
1804
5784
1845
5893
4552
262
3353
664
4964
5386
2882
467
2018
5670
1808
3410
6344
1765
2137
2159
5164
4115
1591
6010
6763
4443
6131
1321
6476
1689
121
4915
5740
1944
4602
882
1507
1484
5553
800
4573
4687
1183
2034
716
2624
1772
7242
1261
928
4320
4146
6698
1709
6114
6465
4593
3187
7522
1204
630
402
3303
2826
5299
575
4453
7413
5742
7063
3817
1581
5569
1249
6276
6251
4800
5378
4318
1488
5002
1408
834
6935
1895
3820
985
3539
1957
6086
3244
161
7273
1444
375
2476
5199
28
4091
4948
6498
3546
4860
6826
7107
4425
6270
7372
1312
625
4684
5390
2009
5329
6953
2001
5934
4537
7218
4849
5919
4735
4733
6901
1501
6836
3543
6808
7087
3760
236
5343
3879
44
6456
90
3656
4195
784
2452
3985
4804
6044
1875
488
1133
7402
3839
5904
1069
2206
3671
5319
2417
4579
6872
308
1427
1683
4666
2577
5946
6516
3642
2909
2050
4551
6343
2645
5030
650
7172
989
2552
4502
4421
5103
2837
5771
2573
4292
3995
4457
27
410
5973
271
3118
388
3584
3638
6923
769
552
2553
6975
2981
6230
801
96
6489
5248
6095
3230
3587
6691
3906
7262
6572
735
5294
4064
1930
7041
374
6555
1310
5075
6891
5327
348
2725
3877
4747
1797
5172
1430
3050
4754
7376
1824
7287
2177
1788
1282
1393
6034
6310
2904
241
4235
1020
7538
5035
2281
640
2520
6422
4980
7030
237
5318
3029
371
4706
4264
2085
5849
2651
7549
2386
4319
6179
2037
2625
6492
6299
1904
392
1748
3849
1187
6873
5359
661
7503
1354
4772
6742
4791
4303
63
4182
5073
2459
7174
2753
1862
2292
5021
6042
3858
3288
6876
1830
4629
4972
7351
6586
6554
658
5626
935
6687
86
6801
5700
5230
5358
649
5031
3726
4398
5458
3339
5759
2960
1349
210
6774
5267
7407
92
273
2403
6201
4170
1560
2760
3678
7322
7104
3014
2949
725
2885
7040
2360
4138
5852
1359
6942
4532
4913
6495
5414
2451
5365
2678
5112
1420
7165
1439
1098
1167
1446
4039
2084
3174
5275
1687
437
3475
5196
6317
4075
2813
511
5557
5346
6553
6268
6593
1224
2258
1503
1983
310
4527
6879
6523
2276
1135
6351
1318
3077
1202
705
4099
576
2040
5682
2245
5757
259
6098
6468
5222
2932
6743
5463
4823
153
616
6642
5045
7278
3467
4251
3953
199
7429
4283
4563
362
7002
2387
2264
4616
1723
4886
4212
7325
1150
1438
589
3264
3863
6851
5077
2430
7390
2199
969
3382
4154
4511
3629
3874
7397
7482
6711
5878
5356
4222
638
4803
160
5437
595
3069
766
2742
598
5701
3861
3639
129
7518
3432
5180
2518
4331
1
2467
1114
4054
3389
4947
3672
7249
4900
1649
4044
6354
5866
3387
1552
1021
6273
5711
4252
2989
7418
1967
6907
319
1568
3350
7211
2921
4601
3702
1464
7004
5830
7358
5245
2948
7072
2142
2263
2280
66
5268
2433
1530
1644
6859
3701
4965
4162
5629
7415
2338
618
3123
3555
3302
3293
629
1372
2671
3222
3892
5665
7319
5611
3989
3640
7020
1429
2246
6425
3498
4518
6109
692
3612
3520
6353
506
298
2700
7382
6558
2860
2694
4286
3789
2128
3089
5587
4332
6657
5236
6222
2215
1269
7268
4019
5756
2589
7193
6550
6442
68
4488
4087
1052
7253
4818
4339
787
2767
865
2881
4656
4056
3085
6623
4838
5976
1945
3199
5599
537
522
4140
6548
819
2516
1820
5516
274
4388
2600
1138
6145
842
3402
3600
7204
3434
1238
7401
4945
7085
306
4346
1926
2844
6700
2854
2180
1095
4994
1009
3593
1495
2314
6215
5253
6599
1886
2588
6969
2579
1403
49
2532
3663
5846
524
6652
1584
1119
6592
4701
3632
2744
7481
4813
6410
5875
2122
792
1229
807
6619
7367
5232
3675
71
7145
931
2888
5782
5809
5888
1369
3738
3979
6948
4076
6823
6170
1911
3074
224
4540
5224
2617
3564
4977
2442
6767
2216
3250
1574
7269
7521
6349
6716
7076
5991
4724
5853
3490
1244
6446
748
6547
477
6330
1155
5373
4370
7352
1795
2143
4524
7343
6367
5015
1836
2002
4807
6814
7487
5244
7348
1329
689
4100
2357
7246
2251
5146
4393
825
3773
2997
1773
4890
6672
37
7308
6853
2375
6186
6927
4495
5240
2548
1798
3171
4244
4883
1094
2388
4043
3891
4161
1418
3191
6061
6449
5394
3798
4577
2324
4024
7280
2165
4192
6413
3810
4810
2325
5447
6645
3885
6146
6399
3704
5859
1990
1455
2994
4156
7281
7267
6159
6990
6721
6451
1197
4073
3774
2238
3035
4868
5749
2171
1115
1554
6412
6494
2176
6519
4710
1600
1153
4881
11
1322
5844
3514
7259
2872
7166
904
1955
3279
4734
3180
7233
2343
7284
1896
1136
4631
828
1766
4571
2628
2488
1169
2101
1659
5911
5454
3621
109
4345
5161
3853
6967
1392
6978
1035
55
5012
7431
1561
7450
633
4224
6241
3463
508
5357
7321
5023
6196
6148
5419
1982
4863
683
1800
5320
179
3031
1968
284
1521
3996
356
3685
6979
2385
3201
4435
5132
4404
5068
997
7435
4470
3658
4673
5559
1577
4806
5400
5992
4456
6210
1799
5958
6381
1303
4086
7379
3001
5996
4621
2906
6421
5301
2204
3367
1253
5140
2887
4111
6426
5564
1300
3471
5427
5891
4427
6464
441
1989
3904
6312
5745
1786
7484
7298
2108
3619
4959
4770
6180
5768
5863
1376
6076
5710
5916
5110
3881
3365
5633
984
2062
6860
229
4840
6484
1226
6589
5764
3552
5565
5953
351
5654
5167
2301
1692
6077
1024
3752
680
6053
2077
3380
163
1708
6699
3033
5069
3599
6709
1064
2969
1473
2833
5630
814
6719
636
5462
5800
2574
6006
5104
3437
5763
1942
1104
4769
6137
4554
4535
2116
5985
3880
391
4711
6585
7290
3337
7355
4787
1665
549
4028
3884
6332
5078
3497
5135
2971
2323
1624
3491
444
7195
991
333
4271
6794
113
381
3609
1548
2650
2242
2801
7524
585
5699
5798
6152
2294
4010
3505
7209
3697
1673
2802
7247
3399
1340
3589
4352
3761
597
1663
2059
3098
7439
717
4129
3378
4685
1194
2977
3841
4290
6438
2585
7466
7276
1876
6384
3261
5523
4160
5290
5760
4605
3942
4227
2013
6778
5252
221
4141
2298
4523
5730
497
2353
3950
7018
7388
3119
7279
947
880
3768
7271
6021
867
2093
3830
3102
2383
7316
4112
6282
759
526
5747
5766
6938
7474
6136
5446
6670
5568
2287
46
1771
7178
3635
412
6951
7331
272
4113
5324
2677
5060
4246
5307
2544
6376
6132
6816
2213
6747
3197
520
7430
1316
4284
130
624
6394
3164
6732
2630
2317
4465
7320
4564
6169
7443
2414
5464
4187
772
4670
1589
6566
1437
3932
3301
2517
1655
2095
542
5260
2074
6253
4127
5029
4379
6080
6051
3333
5204
4570
1790
186
5748
1259
1539
2135
1918
5283
1143
666
2277
6378
3092
1447
5982
2883
6416
7070
1969
87
1134
379
808
1207
6926
2704
1971
4226
687
4546
4322
2824
775
4795
836
829
6911
6280
2010
7427
7428
6597
3245
4665
2877
942
5302
1523
2312
4116
409
7293
278
7231
6629
4661
6626
995
937
3777
1301
701
4020
5083
516
5321
3165
3282
1079
2355
5090
398
15
6216
5585
5983
4708
3582
6075
3846
6612
4371
1469
1551
5044
4637
4520
3421
992
3296
200
3269
2373
6603
6172
423
311
494
7438
6403
3712
4406
9
5116
876
3465
2384
4013
7433
1049
7232
5712
6291
2593
1583
2719
3446
1479
6205
738
4277
41
3431
6745
2554
6320
1927
3384
849
1825
30
3831
3913
6863
7338
4688
2066
1675
6620
6183
4201
3473
5141
2148
6432
1784
3928
4764
1701
861
4067
335
6069
2715
6945
4316
279
6072
396
1233
5841
6466
6302
21
2269
5072
3358
1841
5930
5157
1288
4503
5597
5912
2041
1463
5508
2173
3405
2362
4808
1385
7263
3026
5531
3687
4664
2779
2896
5449
5014
1992
3281
3322
906
4208
1019
1156
309
2082
2696
7264
4132
7386
4446
2858
3352
5737
5158
3163
3898
6915
1454
2157
363
4594
6728
7003
6029
877
2747
2619
4472
2845
3574
5126
2075
3256
1091
3513
4463
1331
1381
1106
1621
3027
2020
2807
275
702
4672
3699
47
6841
7471
5828
1607
6598
4400
3401
4238
2684
3305
4296
3888
3460
5570
7052
7009
328
6925
1228
5455
5550
1585
5923
7456
5216
2193
7460
7053
1534
1476
3356
331
2201
1738
5285
5509
7113
5439
7136
4645
3872
7504
593
3909
2153
4147
1280
2533
5833
5027
2306
719
1477
3101
726
7374
3259
4325
6997
401
4432
148
4228
454
1850
2660
4725
990
3224
3114
2086
6274
3292
6943
5218
4447
2681
223
3790
5838
5408
2666
4367
1054
3274
7384
5326
183
723
7090
2445
6723
4820
5843
1026
446
3252
7314
4816
2295
5100
703
3210
4669
2959
6478
1333
2790
7035
6792
5061
4135
4256
155
1415
1015
4468
3133
1027
5009
1612
1774
4833
5070
172
2723
6452
2349
7112
4698
2416
6224
4891
3674
4281
458
73
6710
7173
7489
3532
538
1513
3852
6724
3502
2889
3524
737
1729
6306
923
3548
4566
3981
491
4259
4391
3516
874
2371
2256
2094
7102
5871
3185
6168
2342
3594
2270
5124
6884
4622
85
1668
5185
2509
1602
3162
6655
1338
7071
3149
2235
1371
3429
4308
1085
